# Works with Dates in  pandas

In [ ]:
import pandas as pd

In [18]:
sample_data={'Name':['Suresh','Ramesh','Mahesh','Satish','Rajesh'],
            'Age':[23,32,43,55,30],
            'City':['Hyderabad','Mumbai','Kolkata','Benglore','Chennai'],
            'Occupation':['Tester','Developer','Admin','Architect','Manager'],
            'Doj':['11/02/2010','12/10/2000','30/09/2005','18/02/2006','24/10/2009']}

In [20]:
df=pd.DataFrame(sample_data)
df

     Name  Age       City Occupation         Doj
0  Suresh   23  Hyderabad     Tester  11/02/2010
1  Ramesh   32     Mumbai  Developer  12/10/2000
2  Mahesh   43    Kolkata      Admin  30/09/2005
3  Satish   55   Benglore  Architect  18/02/2006
4  Rajesh   30    Chennai    Manager  24/10/2009

In [21]:
df.dtypes

Name          object
Age            int64
City          object
Occupation    object
Doj           object
dtype: object

In [22]:
df['Doj']=pd.to_datetime(df['Doj'])

In [23]:
df.dtypes #Doj column converted into datatime datatype

Name                  object
Age                    int64
City                  object
Occupation            object
Doj           datetime64[ns]
dtype: object

# Adding another column as year

In [24]:
df['Year']=df['Doj'].dt.year

In [25]:
df

     Name  Age       City Occupation        Doj  Year
0  Suresh   23  Hyderabad     Tester 2010-11-02  2010
1  Ramesh   32     Mumbai  Developer 2000-12-10  2000
2  Mahesh   43    Kolkata      Admin 2005-09-30  2005
3  Satish   55   Benglore  Architect 2006-02-18  2006
4  Rajesh   30    Chennai    Manager 2009-10-24  2009

In [28]:
df['Doj'].dt.month

0    11
1    12
2     9
3     2
4    10
Name: Doj, dtype: int64

In [29]:
df['Doj'].dt.weekday_name

0     Tuesday
1      Sunday
2      Friday
3    Saturday
4    Saturday
Name: Doj, dtype: object

In [30]:
df['Doj'].dt.quarter

0    4
1    4
2    3
3    1
4    4
Name: Doj, dtype: int64

In [31]:
df['Doj'].dt.daysinmonth

0    30
1    31
2    30
3    28
4    31
Name: Doj, dtype: int64

In [33]:
df[df['Doj'].dt.is_leap_year]

     Name  Age    City Occupation        Doj  Year
1  Ramesh   32  Mumbai  Developer 2000-12-10  2000